
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	РассчитатьТЧ(Элементы.СписокНоменклатуры.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	РассчитатьТЧ(Элементы.СписокНоменклатуры.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	РассчитатьТЧ(Элементы.СписокНоменклатуры.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТЧ(ТекСтр, ПоСумме)
	Если ПоСумме Тогда
		Если ТекСтр.Количество > 0 Тогда
			ТекСтр.Цена = ТекСтр.Сумма / ТекСтр.Количество;
		КонецЕсли;
	Иначе
		ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.Количество;
	КонецЕсли;
КонецПроцедуры